Repository: guh0613/ruri
Catalog: Sources/RuriLocalization/Resources/Interface.xcstrings
Source language: zh_hans
Languages: en

# AppAccountAppearanceView.appearanceChangesSaved
source: 更改会保存到此账号的认证服务。游戏中的外观可能需要重新进入服务器后才更新。
en: Changes are saved to this account's authentication service. You may need to rejoin the server for your in-game appearance to update.

# AppAccountAppearanceView.appearanceError
source: 预览未能加载：%1$@
en: Couldn't load the preview: %1$@

# AppAccountAppearanceView.cape
source: 披风
en: Cape

# AppAccountAppearanceView.capeChanged
source: 已更换披风
en: Cape changed

# AppAccountAppearanceView.capeHidden
source: 已隐藏披风
en: Cape hidden

# AppAccountAppearanceView.capeRemoved
source: 已移除披风
en: Cape removed

# AppAccountAppearanceView.capeUploadUnavailable
source: 此认证站未开放披风上传，请在认证站管理。
en: This authentication service doesn't support cape uploads from Ruri. Manage your cape on its website.

# AppAccountAppearanceView.chooseAgain
source: 重新选择…
en: Choose Again…

# AppAccountAppearanceView.chooseCapePNG
source: 选择披风 PNG…
en: Choose Cape PNG…

# AppAccountAppearanceView.chooseSkinPNG
source: 选择皮肤 PNG…
en: Choose Skin PNG…

# AppAccountAppearanceView.currentSkin
source: 当前皮肤
en: Current Skin

# AppAccountAppearanceView.currentlyInUse
source: 当前正在使用
en: Currently in use

# AppAccountAppearanceView.defaultSkinRestored
source: 已恢复默认皮肤
en: Default skin restored

# AppAccountAppearanceView.expandedPNGTexture
source: 展开的 PNG 纹理
en: PNG Texture Layout

# AppAccountAppearanceView.hiddenCape
source: 隐藏披风
en: Hidden Cape

# AppAccountAppearanceView.hideCape
source: 不显示披风
en: Hide Cape

# AppAccountAppearanceView.noCape
source: 没有披风
en: No Cape

# AppAccountAppearanceView.noCapeInUse
source: 当前未使用披风
en: No cape in use

# AppAccountAppearanceView.noCapeOwned
source: 此账号暂无披风。
en: This account has no capes.

# AppAccountAppearanceView.ownedCapes
source: 已拥有的披风
en: Your Capes

# AppAccountAppearanceView.prepareUpload
source: 准备上传%1$@
en: Upload %1$@

# AppAccountAppearanceView.processing
source: 正在处理…
en: Processing…

# AppAccountAppearanceView.refresh
source: 刷新
en: Refresh

# AppAccountAppearanceView.refreshAppearanceError
source: 更改已提交，但刷新外观失败：%1$@
en: Your changes were submitted, but the appearance preview couldn't be refreshed: %1$@

# AppAccountAppearanceView.removeCurrentCape
source: 移除当前披风
en: Remove Current Cape

# AppAccountAppearanceView.restoreDefaultSkin
source: 恢复默认皮肤
en: Restore Default Skin

# AppAccountAppearanceView.savePNG
source: 保存 PNG…
en: Save PNG…

# AppAccountAppearanceView.skinModel
source: 皮肤模型
en: Skin model

# AppAccountAppearanceView.skinUploadUnavailable
source: 此认证站未开放皮肤上传，请在认证站管理。
en: This authentication service doesn't support skin uploads from Ruri. Manage your skin on its website.

# AppAccountAppearanceView.skinsAndCapes
source: 皮肤与披风
en: Skins and Capes

# AppAccountAppearanceView.texturePreview
source: 纹理预览
en: Texture Preview

# AppAccountAppearanceView.uploadToAccount
source: 上传到此账号
en: Upload to This Account

# AppAccountAppearanceView.uploaded
source: 已上传%1$@
en: %1$@ uploaded

# AppAccountAppearanceView.useCape
source: 使用这件披风
en: Use This Cape

# AppAccountAppearanceView.useDefaultSkin
source: 使用默认皮肤
en: Use Default Skin

# AppAccountsView.account
source: 账号
en: Account

# AppAccountsView.addAccount
source: 添加账号
en: Add Account

# AppAccountsView.appearance
source: 皮肤与披风…
en: Skins and Capes…

# AppAccountsView.credentials
source: 登录凭据保存在 macOS 钥匙串中。外置认证用于对应认证站支持的服务器；离线身份不支持正版验证服务器。
en: Your sign-in credentials are stored in the macOS keychain. Third-party accounts work with servers that use their authentication service. Offline accounts can't join servers that verify Minecraft ownership.

# AppAccountsView.currentAccount
source: 当前使用
en: Currently in use

# AppAccountsView.emptyState
source: 添加 Microsoft、外置认证或离线账号。
en: Add a Microsoft, third-party, or offline account.

# AppAccountsView.refreshLogin
source: 刷新登录状态
en: Refresh Login Status

# AppAccountsView.relogin
source: 重新登录
en: Sign In Again

# AppAccountsView.removeFromRuri
source: 从 Ruri 移除账号
en: Remove Account from Ruri

# AppAccountsView.removeLogin
source: 退出登录并移除
en: Sign Out and Remove

# AppAccountsView.updateAccount
source: 更新账号
en: Update Account

# AppAccountsView.useAccount
source: 使用此账号
en: Use This Account

# AppAddAccountView.accountType
source: 账号类型
en: Account type

# AppAddAccountView.addAccount
source: 添加玩家账号
en: Add Player Account

# AppAddAccountView.addAccountAction
source: 添加账号
en: Add Account

# AppAddAccountView.configureMicrosoft
source: 先配置 Microsoft 应用
en: Set Up Microsoft Sign-In

# AppAddAccountView.continueLogin
source: 继续登录
en: Continue Sign-In

# AppAddAccountView.copyCode
source: 复制代码
en: Copy Code

# AppAddAccountView.enterMicrosoftCode
source: 在浏览器中登录 Microsoft，并输入此代码：
en: Sign in to your Microsoft account in your browser, then enter this code:

# AppAddAccountView.externalAuth
source: 外置认证
en: Third-Party Account

# AppAddAccountView.microsoftHelp
source: Ruri 需要自己的 Microsoft Client ID 才能发起登录。请在设置中填写已启用公共客户端与 Xbox 登录的应用 ID。
en: Ruri needs a Microsoft application client ID to sign you in. In Settings, enter the ID of an app with public client flows and Xbox sign-in enabled.

# AppAddAccountView.minecraftOwnership
source: 使用你拥有 Minecraft Java 版的 Microsoft 账号登录。
en: Sign in with the Microsoft account that owns Minecraft: Java Edition.

# AppAddAccountView.offlineAccount
source: 离线账号
en: Offline Account

# AppAddAccountView.openMicrosoftLogin
source: 打开 Microsoft 登录页面
en: Open Microsoft Sign-In

# AppAddAccountView.openSettings
source: 前往设置
en: Go to Settings

# AppAddAccountView.playerName
source: 玩家名
en: Player name

# AppAddAccountView.playerNameHelp
source: 使用 3–16 位英文字母、数字或下划线。离线账号用于单人游戏与允许离线模式的服务器。
en: Use 3–16 letters (A–Z), numbers, or underscores. Offline accounts work in single-player games and on servers that allow offline mode.

# AppAddAccountView.requestLoginCode
source: 正在请求登录代码…
en: Requesting sign-in code…

# AppAddAccountView.waitingMicrosoftLogin
source: 等待浏览器中完成登录…
en: Waiting for sign-in to finish in your browser…

# AppAppModel.defaultInstanceDirectory
source: 默认实例文件夹
en: Default Instance Folder

# AppAppModel.directoryRecoveryFailed
source: 无法恢复目录登记：%1$@
en: Couldn't restore the saved folder information: %1$@

# AppAppModel.externalChangesDetected
source: 无法同步其他客户端的更改，已暂停写入以保留原数据。 %1$@
en: Couldn't sync changes from another client. Saving is paused to preserve your existing data. %1$@

# AppAppModel.savePaused
source: %1$@ 已暂停本窗口的后续写入和安装/启动。请重新打开 Ruri 载入磁盘上的最新状态。
en: %1$@ Saving, installation, and launching are paused in this window. Reopen Ruri to load the latest data from disk.

# AppAppModel.taskCancelled
source: 任务已取消。重试时会复用可用缓存，并尝试继续未完成的下载。
en: Task canceled. Retrying will reuse available cached files and attempt to resume unfinished downloads.

# AppAppModel.unreadableData
source: 无法读取 Ruri 数据，已暂停写入以保护原文件。 %1$@
en: Couldn't read Ruri's data. Saving is paused to protect your files. %1$@

# AppAppModelAccounts.credentialsRefreshed
source: 已刷新 %1$@ 的登录状态。
en: Login status refreshed for %1$@.

# AppAppModelContent.installContent
source: 安装 %1$@
en: Install %1$@

# AppAppModelContent.installed
source: %1$@ 已安装
en: %1$@ installed

# AppAppModelContent.manifestRead
source: 整合包清单已读取
en: Modpack manifest read

# AppAppModelCurseForge.installPack
source: 安装 %1$@
en: Install %1$@

# AppAppModelCurseForge.packInstalled
source: %1$@ 已安装
en: %1$@ installed

# AppAppModelCurseForge.readPack
source: 读取 %1$@
en: Read %1$@

# AppAppModelDirectories.cleanedCopyRecord
source: 已清理完成的复制记录，目标内容保留。
en: Copy records cleared. The copied files have been kept.

# AppAppModelDirectories.copyAndSwitch
source: 复制并切换
en: Copy and Switch

# AppAppModelDirectories.directorySwitchCompleted
source: %1$@ 已%2$@；原目录及备份已保留。
en: %1$@: %2$@ complete. The original directory and backup have been kept.

# AppAppModelDirectories.directorySwitchRecovered
source: 已恢复到切换前的状态，复制工作区另行保留。
en: The previous directory settings have been restored. The copied files have been kept separately.

# AppAppModelDirectories.recoverDirectoryCopy
source: 恢复 %1$@ 的目录复制
en: Recover Directory Copy for %1$@

# AppAppModelDirectories.relocateCustomDirectory
source: 重新定位自定义游戏目录
en: Locate Custom Game Directory

# AppAppModelDirectories.relocatedInstances
source: 已更新 %1$lld 个实例的目录位置，游戏文件保留在所选文件夹。
en: Directory locations updated for %1$lld instances; game files remain in the selected folder.

# AppAppModelDirectories.runDirectoryForInstance
source: %1$@ %2$@ 的运行目录
en: %1$@: %2$@ Run Directory

# AppAppModelDirectories.switchDirectory
source: 切换
en: Switch

# AppAppModelDirectories.switchGameDirectory
source: 切换游戏文件夹
en: Switch Game Folder

# AppAppModelDirectories.useTargetContents
source: 使用目标内容
en: Use Destination Contents

# AppAppModelGameMonitoring.acknowledgeSessionFailure
source: 无法保存运行记录的已读状态：%1$@
en: Couldn't mark the session record as read: %1$@

# AppAppModelGameMonitoring.gameWindowUnavailable
source: 暂时无法切回游戏窗口，请从 Dock 或应用切换器选择游戏。
en: Couldn't switch back to the game window. Select the game from the Dock or app switcher.

# AppAppModelGameMonitoring.inaccessibleFolder
source: 文件夹无法访问
en: Folder inaccessible

# AppAppModelGameMonitoring.inaccessibleGameDirectory
source: 游戏目录无法访问
en: Game directory inaccessible

# AppAppModelGameMonitoring.launching
source: 正在启动
en: Launching

# AppAppModelGameMonitoring.monitoringDisconnected
source: 监控已断开
en: Monitoring disconnected

# AppAppModelGameMonitoring.monitoringStopped
source: 游戏或启动命令仍在运行，监控已中断
en: The game or launch command is still running; monitoring has stopped

# AppAppModelGameMonitoring.normalExitRequested
source: 已提交正常退出请求，等待游戏处理。
en: Quit request sent. Waiting for the game to respond.

# AppAppModelGameMonitoring.pendingCopy
source: 实例复制待恢复
en: Instance copy needs recovery

# AppAppModelGameMonitoring.pendingDirectoryCopy
source: 目录复制待恢复
en: Directory copy needs recovery

# AppAppModelGameMonitoring.pendingMove
source: 实例移动待恢复
en: Instance move needs recovery

# AppAppModelGameMonitoring.running
source: 运行中
en: Running

# AppAppModelGameMonitoring.savingRecord
source: 正在保存记录
en: Saving record

# AppAppModelGameMonitoring.statusNeedsConfirmation
source: 状态待确认
en: Game status needs confirmation

# AppAppModelGameMonitoring.statusUnconfirmed
source: 监控已中断，运行状态待确认
en: Monitoring stopped. Game status is unknown.

# AppAppModelGameMonitoring.terminateGameProcess
source: 终止“%1$@”的游戏进程？
en: Terminate the game process for “%1$@”?

# AppAppModelGameMonitoring.terminateProcess
source: 终止进程
en: Terminate Process

# AppAppModelGameMonitoring.terminateWarning
source: 这可能打断尚未完成的存档写入。仅在游戏无法正常退出时使用；如果游戏还能响应，请先返回游戏退出。
en: This may interrupt a world save. Use this only if the game won't quit. If it still responds, return to the game and quit from its menu.

# AppAppModelGameMonitoring.terminatingProcess
source: 正在终止进程
en: Terminating process

# AppAppModelGameMonitoring.unreadableLog
source: 无法读取 %1$@ 的运行日志：%2$@
en: Couldn't read the session log for %1$@: %2$@

# AppAppModelGameMonitoring.waitingForExit
source: 等待游戏退出
en: Waiting for the game to exit

# AppAppModelInstallation.changeLoader
source: 更换 %1$@ 的加载器
en: Change Loader for %1$@

# AppAppModelInstallation.installInstance
source: 安装 %1$@
en: Install %1$@

# AppAppModelInstallation.installationResult
source: %1$@ 已准备就绪
en: %1$@ is ready

# AppAppModelInstallation.loaderConfigurationRestored
source: 已恢复上次的加载器配置
en: Previous loader configuration restored

# AppAppModelInstallation.loaderConfigurationSaved
source: %1$@ 已切换为 %2$@，下次启动生效
en: %1$@ now uses %2$@. This takes effect the next time you launch the game.

# AppAppModelInstallation.repairInstance
source: 修复 %1$@
en: Repair %1$@

# AppAppModelInstallation.restoreLoaderConfiguration
source: 恢复 %1$@ 的加载器配置
en: Restore Loader Configuration for %1$@

# AppAppModelInstanceCopies.copyCompleted
source: 副本已完成，复制记录已清理。
en: Copy complete. Temporary copy records have been cleared.

# AppAppModelInstanceCopies.copyCreated
source: 已创建副本“%1$@”。
en: Created copy “%1$@”.

# AppAppModelInstanceCopies.copyInstance
source: 复制 %1$@
en: Copy %1$@

# AppAppModelInstanceCopies.copyKept
source: 未完成的副本已另行保留，原实例可继续使用。
en: The incomplete copy has been kept separately. You can continue using the original instance.

# AppAppModelInstanceCopies.recoverInstanceCopy
source: 恢复 %1$@ 的实例复制
en: Recover Instance Copy for %1$@

# AppAppModelInstanceMoves.instanceMoveCompleted
source: 实例移动已完成，原文件与工作记录已清理。
en: Move complete. The original files and temporary operation records have been removed.

# AppAppModelInstanceMoves.instanceMoved
source: 已移动“%1$@”。
en: Moved “%1$@”.

# AppAppModelInstanceMoves.moveInstance
source: 移动 %1$@
en: Move %1$@

# AppAppModelInstanceMoves.moveNeedsRecovery
source: 实例已移至目标位置，还需完成清理。
en: The instance has been moved. Cleanup is still needed.

# AppAppModelInstanceMoves.recoverInstanceMove
source: 恢复 %1$@ 的移动
en: Recover Move for %1$@

# AppAppModelInstanceTransfers.exportInstance
source: 导出 %1$@
en: Export %1$@

# AppAppModelInstanceTransfers.finishImport
source: 导入 %1$@
en: Import %1$@

# AppAppModelInstanceTransfers.instanceExported
source: %1$@ 已导出
en: %1$@ exported

# AppAppModelInstanceTransfers.instanceImported
source: %1$@ 已导入
en: %1$@ imported

# AppAppModelInstanceTransfers.prepareImport
source: 读取 %1$@
en: Read %1$@

# AppAppModelInstanceTransfers.transferFormats
source: 选择实例目录或整合包：Ruri、Prism/MultiMC、Modrinth、CurseForge、HMCL 或 MCBBS。
en: Choose an instance directory or modpack: Ruri, Prism/MultiMC, Modrinth, CurseForge, HMCL, or MCBBS.

# AppAppModelJava.addLocalJava
source: 添加本机 Java
en: Add Local Java

# AppAppModelJava.chooseJavaAgain
source: 重新选择 Java
en: Choose Java Again

# AppAppModelJava.cleanIncompleteJavaDownload
source: 清理 Java 未完成下载
en: Clean Up Unfinished Java Download

# AppAppModelJava.defaultJavaUpdated
source: 已更新默认 Java，下一次启动生效
en: Default Java updated. This takes effect the next time you launch the game.

# AppAppModelJava.install
source: 安装
en: Install

# AppAppModelJava.javaAdded
source: Java 已添加，可在启动设置中选择
en: Java added. You can select it in launch settings.

# AppAppModelJava.javaInstalled
source: Java 已安装
en: Java installed

# AppAppModelJava.javaMovedToTrash
source: Java 文件已移到废纸篓
en: Java files moved to Trash

# AppAppModelJava.javaPathPurpose
source: 选择 java 可执行文件、JDK 包或 Java Home 文件夹。
en: Choose a java executable, a JDK bundle, or a Java home folder.

# AppAppModelJava.javaPathReplacementDetails
source: 选择新的 Java 路径，原来指定这一路径的实例和默认设置会随之更新。
en: Choose the new location of this Java installation. Ruri will update any instances and default settings that use the old path.

# AppAppModelJava.javaRepaired
source: Java 已修复
en: Java repaired

# AppAppModelJava.removeJava
source: 移除 Java
en: Remove Java

# AppAppModelJava.repair
source: 修复
en: Repair

# AppAppModelLaunching.instanceInUse
source: 此实例或共享目录正在使用中，请查看运行记录或实例设置。
en: This instance or a directory it shares is in use. Check Session History or Instance Settings.

# AppAppModelLaunching.launchFailureNotice
source: %1$@，可在运行记录中查看详情。
en: %1$@. See Session History for details.

# AppAppModelLaunching.launchingInstance
source: 启动 %1$@
en: Launch %1$@

# AppAppModelLaunching.runRecordIncomplete
source: 运行记录未能完整写入：%1$@
en: Session record couldn't be fully saved: %1$@

# AppAppModelLaunching.worldLaunch
source: [Ruri] 进入存档：%1$@
en: [Ruri] Entering world: %1$@

# AppAppModelMinecraftDirectory.addGameFolder
source: 添加文件夹
en: Add Folder

# AppAppModelMinecraftDirectory.addGameFolderEntry
source: 添加游戏文件夹
en: Add Game Folder

# AppAppModelMinecraftDirectory.folderSelectionHelp
source: 选择游戏文件夹或其上一级目录，确认位置和显示名称后添加。
en: Choose a game folder or its parent folder, then confirm its location and display name before adding it.

# AppAppModelMinecraftDirectory.recoverGameFolder
source: 恢复游戏文件夹
en: Restore Game Folder

# AppAppModelModpackUpdates.applyingModpackUpdate
source: 更新 %1$@
en: Update %1$@

# AppAppModelModpackUpdates.modpackRollbackComplete
source: 已回退上次整合包更新
en: Last modpack update rolled back

# AppAppModelModpackUpdates.modpackRollbackPreservedChanges
source: 已回退整合包，保留了 %1$lld 项更新后的本地修改
en: Modpack rolled back. %1$lld local changes made after the update were kept.

# AppAppModelModpackUpdates.modpackUpdateRecovered
source: 整合包更新记录已恢复
en: Modpack update record recovered

# AppAppModelModpackUpdates.modpackUpdated
source: %1$@ 已更新至 %2$@
en: %1$@ updated to %2$@

# AppAppModelModpackUpdates.preparingModpackUpdate
source: 准备 %1$@ 的整合包更新
en: Prepare Modpack Update for %1$@

# AppAppModelModpackUpdates.recoveringModpackUpdate
source: 恢复 %1$@ 的整合包更新
en: Recover Modpack Update for %1$@

# AppAppModelModpackUpdates.rollingBackModpackUpdate
source: 回退 %1$@ 的整合包更新
en: Roll Back Modpack Update for %1$@

# AppAppModelSessions.historyReadWarning
source: 部分运行记录暂时无法读取：%1$@
en: Some session records can't be read at this time: %1$@

# AppContentBatchUpdateView.batchUpdate
source: 批量更新 %1$lld 项内容
en: Update %1$lld Items

# AppContentBatchUpdateView.fileSummary
source: 共 %1$lld 个文件 · %2$@
en: %1$lld files total · %2$@

# AppContentBatchUpdateView.itemsUpdated
source: 已更新 %1$lld 项内容
en: Updated %1$lld items

# AppContentBatchUpdateView.keepDisabled
source: 更新后继续保持停用
en: Keep Disabled After Update

# AppContentBatchUpdateView.newVersion
source: 新增 · %1$@
en: New · %1$@

# AppContentBatchUpdateView.replacementDetails
source: 更新保留停用状态；取消或失败时保留原文件。
en: Disabled items stay disabled after updating. If an update is canceled or fails, the original files are kept.

# AppContentBatchUpdateView.requiredDependencies
source: 必需依赖
en: Required Dependencies

# AppContentBatchUpdateView.updateAll
source: 更新全部 %1$lld 项
en: Update All %1$lld Items

# AppContentBatchUpdateView.updateItems
source: 更新 %1$lld 项内容
en: Update %1$lld Items

# AppContentInstallView.chooseInstalledInstance
source: 请先选择已安装的游戏实例。
en: Choose an instance with the game installed.

# AppContentInstallView.chooseInstance
source: 选择一个实例
en: Choose an Instance

# AppContentInstallView.contentVersion
source: 内容版本
en: Content version

# AppContentInstallView.dependencyHelp
source: 自动安装必需依赖。
en: Required dependencies are installed automatically.

# AppContentInstallView.findCompatibleVersions
source: 查找兼容版本…
en: Finding compatible versions…

# AppContentInstallView.installContent
source: 安装
en: Install

# AppContentInstallView.installToInstance
source: 安装到实例
en: Install to Instance

# AppContentInstallView.noCompatibleVersions
source: 没有兼容的版本。
en: No compatible versions.

# AppContentInstallView.shaderHelp
source: 使用光影需要安装 Iris 或其他兼容的光影模组。
en: Shader packs require Iris or another compatible shader mod.

# AppContentInstallView.viewModpack
source: 查看整合包
en: View Modpack

# AppContentInstallView.viewOnModrinth
source: 在 Modrinth 查看
en: View on Modrinth

# AppContentRemovalView.allStatus
source: 全部状态
en: All Statuses

# AppContentRemovalView.disabledStatus
source: 已停用
en: Disabled

# AppContentRemovalView.enabledStatus
source: 已启用
en: Enabled

# AppContentRemovalView.moveToTrash
source: 移到废纸篓
en: Move to Trash

# AppContentRemovalView.removeContent
source: 移除 %1$lld 项游戏内容
en: Remove %1$lld Content Items

# AppContentRemovalView.removeContentHelp
source: 所选文件会一起移到废纸篓。若仍有已启用的内容依赖它们，整批操作会停止。
en: Selected files will be moved to Trash together. If any enabled content still depends on them, the entire operation will stop.

# AppContentVersionView.currentVersion
source: 当前版本：%1$@ · %2$@
en: Current version: %1$@ · %2$@

# AppContentVersionView.findCompatibleVersion
source: 查找兼容版本…
en: Finding compatible versions…

# AppContentVersionView.includePrereleases
source: 包含 Beta / Alpha 测试版
en: Include Beta / Alpha releases

# AppContentVersionView.installPlan
source: 将安装 %1$lld 个文件，包含必需依赖。
en: %1$lld files will be installed, including required dependencies.

# AppContentVersionView.installSelectedVersion
source: 安装所选版本
en: Install Selected Version

# AppContentVersionView.installed
source: 已安装
en: Installed

# AppContentVersionView.instanceRemoved
source: 实例已移除
en: Instance removed

# AppContentVersionView.nextPage
source: 下一页
en: Next Page

# AppContentVersionView.noMatchingVersion
source: 没有匹配的版本。可查看测试版或其他分页。
en: No matching versions. Try including prereleases or checking another page.

# AppContentVersionView.pageNumber
source: 第 %1$lld 页
en: Page %1$lld

# AppContentVersionView.previousPage
source: 上一页
en: Previous Page

# AppContentVersionView.replaceItemVersion
source: 更换 %1$@ 的版本
en: Change Version of %1$@

# AppContentVersionView.replaceVersion
source: 更换内容版本
en: Change Content Version

# AppContentVersionView.resolveDependencies
source: 正在解析必需依赖…
en: Resolving required dependencies…

# AppContentVersionView.returnToVersions
source: 返回版本列表
en: Back to Version List

# AppContentVersionView.stableRelease
source: 正式版
en: Release

# AppContentVersionView.versionReplaced
source: %1$@ 已更换为 %2$@
en: %1$@ changed to %2$@

# AppContentVersionView.versionSelectionInfo
source: 自动安装必需依赖，并保留当前启用或停用状态。
en: Required dependencies are installed automatically. The item stays enabled or disabled as it was before.

# AppContentVersionView.viewInstallPlan
source: 查看安装清单
en: View Install Plan

# AppCreateInstanceView.createAndInstall
source: 创建并安装
en: Create and Install

# AppCreateInstanceView.createInstance
source: 新建实例
en: New Instance

# AppCreateInstanceView.fetchingVersions
source: 正在获取版本…
en: Fetching versions…

# AppCreateInstanceView.findCompatibleLoaders
source: 查找兼容的加载器…
en: Finding compatible loaders…

# AppCreateInstanceView.instanceNameOptional
source: 实例名称（可选）
en: Instance name (optional)

# AppCreateInstanceView.latestRelease
source: 最新正式版
en: Latest Release

# AppCreateInstanceView.loader
source: 加载器
en: Loader

# AppCreateInstanceView.loaderVersion
source: 加载器版本
en: Loader version

# AppCreateInstanceView.noCompatibleLoader
source: 此 Minecraft 版本暂无兼容加载器。
en: No compatible loader is available for this Minecraft version.

# AppCreateInstanceView.optifineSource
source: OptiFine 版本与安装包由 BMCLAPI 提供。
en: OptiFine versions and installers are provided by BMCLAPI.

# AppCreateInstanceView.retry
source: 重试
en: Retry

# AppCreateInstanceView.saveLocation
source: 保存到：%1$@
en: Save to: %1$@

# AppCreateInstanceView.searchVersions
source: 搜索 Minecraft 版本
en: Search Minecraft versions

# AppCreateInstanceView.snapshotsAndOldVersions
source: 快照与旧版
en: Snapshots and older versions

# AppCurseForgeFilePicker.automaticDownload
source: 自动下载
en: Automatic Download

# AppCurseForgeFilePicker.chooseAnotherFile
source: 重新选择…
en: Choose Again…

# AppCurseForgeFilePicker.chooseDownloadedFile
source: 选择已下载文件…
en: Choose Downloaded File…

# AppCurseForgeFilePicker.manualDownload
source: 手动下载
en: Manual Download

# AppCurseForgeFilePicker.manualDownloadNotice
source: 部分作者要求从 CurseForge 页面下载。下载对应版本后选择文件，校验通过即可继续安装。
en: Some authors require downloads from their CurseForge page. Download the matching version and select the file; installation can continue once verification succeeds.

# AppCurseForgeFilePicker.openDownloadPage
source: 打开下载页面
en: Open Download Page

# AppCurseForgeFilePicker.selectFile
source: 选择 %1$@。Ruri 会核对版本、大小与校验值。
en: Select %1$@. Ruri will verify its version, size, and checksum.

# AppCurseForgeFilePicker.verified
source: 已校验
en: Verified

# AppCurseForgeInstallView.back
source: 返回
en: Back

# AppCurseForgeInstallView.chooseInstance
source: 选择实例
en: Choose an Instance

# AppCurseForgeInstallView.communityContent
source: 社区创作
en: Community Content

# AppCurseForgeInstallView.contentVersion
source: 内容版本
en: Content version

# AppCurseForgeInstallView.findCompatibleVersions
source: 查找兼容版本…
en: Finding compatible versions…

# AppCurseForgeInstallView.install
source: 安装
en: Install

# AppCurseForgeInstallView.installPlan
source: 将为 %1$@ 安装 %2$lld 个文件，包含必需依赖。
en: %2$lld files will be installed for %1$@, including required dependencies.

# AppCurseForgeInstallView.installToInstance
source: 安装到实例
en: Install to Instance
